// 负责将图片资源加载到SDRAM中，规划每一个显存资源的位置，定义描述符
// 负责规划SDRAM的总区域

// 每个图片描述符都是一个数字，代表着：该图片存放在SD卡的某个扇区中，而且乘以512就是SDRAM中的存放位置
parameter IMG_NUM = 247;
parameter [19:0] IMG_INDEX [IMG_NUM-1:0] = {
    // 这里是background
    20'd10000,
    //
    20'd10, 20'd20, 20'd30, 20'd40, 20'd50,
    20'd110, 20'd120, 20'd130, 20'd140, 20'd150,
    20'd210, 20'd220, 20'd230, 20'd240, 20'd250,
    20'd310, 20'd320, 20'd330, 20'd340, 20'd350,
    20'd410, 20'd420, 20'd430, 20'd440, 20'd450,
    20'd510, 20'd520, 20'd530, 20'd540, 20'd550,
    20'd610, 20'd620, 20'd630, 20'd640, 20'd650,
    20'd710, 20'd720, 20'd730, 20'd740, 20'd750,
    20'd1010, 20'd1020, 20'd1030, 20'd1040, 20'd1050,
    20'd1110, 20'd1120, 20'd1130, 20'd1140, 20'd1150,
    20'd1210, 20'd1220, 20'd1230, 20'd1240, 20'd1250,
    20'd1310, 20'd1320, 20'd1330, 20'd1340, 20'd1350,
    20'd1410, 20'd1420, 20'd1430, 20'd1440, 20'd1450,
    20'd1510, 20'd1520, 20'd1530, 20'd1540, 20'd1550,
    20'd1610, 20'd1620, 20'd1630, 20'd1640, 20'd1650,
    20'd1710, 20'd1720, 20'd1730, 20'd1740, 20'd1750,
    //辅助图形
    20'd2000, 20'd2010, 20'd2020, 20'd2030, 20'd2040,
    20'd2050, 20'd2060, 20'd2070, 20'd2080, 20'd2090,
    20'd2100, 20'd2110, 20'd2120, 20'd2130, 20'd2140,
    20'd2150, 20'd2160, 20'd2170, 20'd2180, 20'd2190,
    20'd2200, 20'd2210, 20'd2220, 20'd2230, 20'd2240,
    20'd2250, 20'd2260, 20'd2270, 20'd2280, 20'd2290,
    20'd2300, 20'd2310, 20'd2320, 20'd2330, 20'd2340,
    20'd2350, 20'd2360, 20'd2370, 20'd2380, 20'd2390,
    20'd2400, 20'd2410, 20'd2420, 20'd2430, 20'd2440,
    20'd2450, 20'd2460, 20'd2470, 20'd2480, 20'd2490,
    20'd2500, 20'd2510, 20'd2520, 20'd2530, 20'd2540,
    20'd2550, 20'd2560, 20'd2570, 20'd2580, 20'd2590,
    20'd2600, 20'd2610, 20'd2620, 20'd2630, 20'd2640,
    20'd2650, 20'd2660, 20'd2670, 20'd2680, 20'd2690,
    20'd2700, 20'd2710, 20'd2800, 20'd2810,
    20'd3000, 20'd3010, 20'd3020, 20'd3030, 20'd3040,
    20'd3050, 20'd3060, 20'd3070, 20'd3080, 20'd3090,
    20'd3100, 20'd3110, 20'd3120, 20'd3130, 20'd3140,
    20'd3150, 20'd3160, 20'd3170, 20'd3180, 20'd3190,
    20'd3200, 20'd3210, 20'd3220, 20'd3230, 20'd3240,
    20'd3250, 20'd3260, 20'd3270, 20'd3280, 20'd3290,
    20'd3300, 20'd3310, 20'd3320, 20'd3330, 20'd3340,
    20'd3350, 20'd3360, 20'd3370, 20'd3380, 20'd3390,
    20'd3400, 20'd3410, 20'd3420, 20'd3430, 20'd3440,
    20'd3450, 20'd3460, 20'd3470, 20'd3480, 20'd3490,
    20'd3500, 20'd3510, 20'd3520, 20'd3530, 20'd3540,
    20'd3550, 20'd3560, 20'd3570, 20'd3580, 20'd3590,
    20'd3600, 20'd3610, 20'd3620, 20'd3630, 20'd3640,
    20'd3650, 20'd3660, 20'd3670, 20'd3680, 20'd3690,
    20'd3700, 20'd3710, 20'd3800, 20'd3810,
    20'd4010, 20'd4020, 20'd4030, 20'd4040, 20'd4050,
    20'd4100, 20'd4110, 20'd4120, 20'd4130, 20'd4140,
    20'd4150, 20'd4160, 20'd4170, 20'd4180, 20'd4190,
    //足球
    20'd5010, 20'd5020, 20'd5030
};
parameter [11:0] IMG_WIDTH [IMG_NUM-1:0] = {
    // background
    12'd1280,
    //
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32
};
parameter [11:0] IMG_HEIGHT [IMG_NUM-1:0] = {
    //background
    12'd720,
    //
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32, 12'd32, 12'd32, 12'd32, 12'd32,
    12'd32
};
module vm_init(
    // 总控制
    input vm_init_ui_clk,
    input vm_init_ui_rst,
    input init_start,
    output reg init_end,            //当加载结束后，会向外界持续输出高电平
    // SDRAM和SD卡向内输入的信息,
    input [7:0] sd_buffer[511:0],
    input sd_read_end,
    input cmd_done,
    //向外控制SD卡和SDRAM的信号 [TODO]外界需要进行信号的对接
    output sd_read_start,
    output [31:0] curr_sd_addr,
    output [1:0] sdram_cmd,
    output [29:0] curr_sdram_addr,
    output [63:0] sdram_buffer
);
    
    /******************  ImgLoader  ****************/
    reg load_start;
    reg load_end;
    reg last_load_end;
    reg [11:0] img_width;
    reg [11:0] img_height;
    reg [31:0] sd_start_addr;
    reg [29:0] sdram_start_addr;
    ///////////// 一定一定要检查信号宽度，2025.5.15日我因为loader_sdram_cmd误写成一位而被折磨了2个小时
    async_ImgLoader u_async_ImgLoader(
        //数据总信息
        // .debug_number(number),
        .imgloader_ui_clk(vm_init_ui_clk),       // 仍旧使用显存的时钟频率
        .ui_rst(vm_init_ui_rst),
        .load_start(load_start),           //开始加载一个命令
        .load_end(load_end),        //图片加载结束，可以开始下一次加载
        .in_width(img_width),         
        .in_height(img_height),        // 最终读取的数据量为：img_width*img_height*3 bytes
        .sd_start_addr(sd_start_addr),    // SD卡图片的起始地址
        .sdram_start_addr(sdram_start_addr),  // SDRAM待写入的起始地址
        // .loader_info(number[31:8]),
        //SD
        .loader_sd_read_end(sd_read_end),
        .loader_sd_read_start(sd_read_start),
        .loader_curr_sd_addr(curr_sd_addr),
        .loader_sd_buffer(sd_buffer),      // 从sd卡读取的数据 [TODO]这种方法语法是否正确？
        //SDRAM
        .loader_sdram_write_end(cmd_done),
        .loader_sdram_cmd(sdram_cmd),           // SDRAM输出命令，这里仅仅使用2来写入
        .loader_curr_sdram_addr(curr_sdram_addr),      // SDRAM输出的地址
        .loader_sdram_buffer(sdram_buffer)          // 向SDRAM输出的数据
    );

    // 每一个加载

    
    localparam [3:0] UNINIT=0 , LOAD=1, DONE = 2;
    reg [7:0] load_index;       //当前正在加载第几个图片
    reg [3:0]vm_init_stat;       //显存状态
    reg [1:0] done_delay_counter;         //用于最后延时释放load_done信号
    always @(posedge vm_init_ui_clk)begin       //显存逻辑：使用sdram输出的时钟
        if(vm_init_ui_rst)begin
            load_index <= 0;
            vm_init_stat <= UNINIT;
            load_start <= 1'b0;
            img_width <= 12'd32;
            img_height <= 12'd32;
            sd_start_addr <= 32'd0;
            sdram_start_addr <= 30'd0;
            last_load_end <= 1'b0;
            init_end <= 1'b0;
            done_delay_counter <= 2'b0;
        end else begin
            if(vm_init_stat == UNINIT)begin
                if(init_start)begin
                    vm_init_stat <= LOAD;        // SDRAM初始化完成，进入Load Sources状态
                end
            end else if(vm_init_stat == LOAD)begin
                img_width <= IMG_WIDTH[load_index];
                img_height <= IMG_HEIGHT[load_index];
                sd_start_addr <= { {12{1'b0}}, IMG_INDEX[load_index] } << 9;
                sdram_start_addr <= { {10{1'b0}}, IMG_INDEX[load_index] } << 9;
                load_start <= 1'b1;     //开始加载数据
                if( (~last_load_end) & load_end )begin
                    load_start <= 1'b0;
                    if(load_index == IMG_NUM-1)begin
                        vm_init_stat <= DONE;        // 加载完成，进入Done状态
                        init_end <= 1'b1;        
                        load_index <= 0;
                    end else begin
                        load_index <= load_index + 1;
                    end
                end
            end else begin      // DONE 加载完成
                init_end <= 1'b1;       // 因为该模块在加载后就没有用了，所以可以用最简单的通讯协议
            end
            last_load_end <= load_end;
        end
    end

endmodule